import styles from "./Document.module.css";

const Document = () => {
  return (
    <p className={styles.wrapper}>
      株式会社アイランド不動産（以下、「当社」といいます。）は、当社のWebサイト（以下、「当Webサイト」といいます。）を運営するに当たり、以下のとおり、当Webサイトにおける個人情報の取り扱いに関するポリシーを定め（以下、「本ポリシー」といいます。）、お客様のプライバシーを尊重し、日本の個人情報の保護に関する法律を含む各国の適用法令を遵守した個人情報の取得、保管、利用、生成又は移転（以下、「取り扱い」といいます。）を実施します。
      <br />
      <br />
      1.個人情報取り扱いの責任主体
      当Webサイトにおけるお客様の個人情報の取り扱いの責任主体は当社です。
      <br />
      <br />
      2.取得する個人情報の種類 当社は、以下のような個人情報を取得します。
      お客様を識別し連絡を取るための基本的な個人情報（氏名、電話番号、メールアドレス、住所、会社名、役職、学校名（お客様が学生の場合）等）
      当Webサイトの利用状況（閲覧履歴、IPアドレス、ログイン履歴、IPアドレスに対応する所在国等）
      お客様からのお問い合わせ内容及びその後の応答内容
      その他当社が当Webサイトを通して取得した個人情報
      <br />
      <br />
      3.個人情報の取得方法やお客様が個人情報を提供しないことの効果等
      当社は、当Webサイトを通して、以下のような場面において、お客様から直接、個人情報を取得します。
      お客様が当Webサイトを利用されるとき お客様がお問い合わせをされるとき
      また、当社は、当Webサイトの利用状況について以下サービスから間接的に取得する場合があります。
      Web分析サービス（Google Analytics）のプロバイダーであるGoogle
      IPジオロケーションデータベースのプロバイダーであるGeolocation Technology
      マーケティングオートメーションサービス（Marketing Cloud Account
      Engagement、旧Pardot）のプロバイダーであるSalesforce
      お客様による当社への個人情報の提供は、当社との契約の締結又は履行に必要であることや適用される法令に基づく義務であることを含めて必須である場合があります。このように提供が必須な情報をご提供いただけない場合やお客様が当社に提供した情報が不正確であった場合には、お客様は、お問い合わせ、当社イベントへの登録を含む、当Webサイトのサービスを利用できない可能性があります。
      <br />
      <br />
      4.個人情報の利用目的
      当社は、個人情報を以下の目的（各目的に必要な範囲において、下記9記載の各受領者に提供することを含みます。）のために利用します。
      お客様の当Webサイト利用状況に基づきパーソナライズ（お客様の興味・関心やニーズの分析を含みます。）した、当社サービス及び製品に関する情報の提供
      営業及びマーケティング活動（お客様の興味・関心やニーズの分析を利用したマーケティング活動を含みます。）
      お客様との取引に必要な業務の遂行
      当社製品、サービス、当Webサイトの内容及び当Webサイトにおけるお客様のエクスペリエンスの品質の改善（お客様の興味関心やニーズの分析を利用した品質の改善を含みます。）
      新たな製品やサービスの企画、開発（お客様の興味・関心やニーズの分析を利用した企画、開発を含みます。）
      お問い合わせへの対応 不正、欺瞞的又は違法な利用の検知、調査、防止
      当社の正当な利益の保護
      <br />
      <br />
      5.センシティブ情報
      当社は、通常は、人種や民族的出身、宗教や哲学的信念、健康に関する情報等、適用法令によってセンシティブ情報と定義される個人情報を取得しません。やむを得ず当社がセンシティブ情報を取得する場合は、お客様から同意を取得する等適用法令に従って必要な措置を講じます。
      <br />
      <br />
      6.子どもの個人情報
      当Webサイトは16歳未満の方の利用を想定しておりません。やむを得ず子どもの個人情報を取得する必要が生じた場合は、法定代理人の方の同意を取得する等適用法令に従って必要な措置を講じます。
      7.クッキー（Cookie）について
      クッキー（Cookie）は、一定の記録を保持する目的で、お客さまの端末に当Webサイトが送付する小さなテキストファイルです。ローカルストレージも、一定の記録を保持する目的で、お客さまの端末のブラウザ上に情報を保存する仕組みです。
      クッキー等を利用することにより、当社は以下のことが可能になります。
      お客さまの端末（ブラウザ等）が当Webサイト上の言語等の設定やログイン状態、マイリストに登録した製品情報等の利用状況を記憶することにより、パーソナライズされた、よりよいユーザーエクスペリエンスをお客様に提供します。（必須クッキー等）
      お客様の当Webサイトの利用状況を追跡し、当Webサイトを改良し、よりお客様の関心に合う可能性の高いパーソナライズされた情報を提供するための有用かつ重要な知見を得ます。（パフォーマンスクッキー等）
      適用法令により必要な場合、当社はお客様にクッキー等の設定に同意いただくよう求めます。
      <br />
      <br />
      8.情報の保管期間
      当社は、お客様の個人情報を、上記の目的のために必要な期間、適用法令に従って保管します。当社は、個人情報の適切な保存期間を決定するために、個人情報の量、性質、および機密性、個人情報の不正使用または開示による潜在的な損害のリスク、当社が個人情報を処理する目的、および他の手段でそれらの目的を達成できるかどうか、ならびに適用される法的要件を考慮します。お客様の個人情報を利用する必要がなくなった場合、当社は、適用法令及び当社の定める手続きに従って、お客様の個人情報を消去します。
      <br />
      <br />
      9.個人情報の外国にある第三者への提供
      上記9記載の個人情報の開示が、適用法令が定義する越境移転に該当する場合、当社はその越境移転に対するお客様の同意を取得する等適用法令が求める適切なデータ保護措置を講じます。
      <br />
      <br />
      10.安全管理措置
      当社は、個人情報を取り扱う各部署に情報管理責任者を置き、個人情報を正確かつ最新の状態に保ち、個人情報への不正アクセス、紛失、破壊、改ざん及び漏えい等を防止するための措置を講じます。また、個人情報の管理に関する社内規程を定め、当社従業者（役員、一般従業員、パートタイマー、派遣労働者等を含みます。）、その他関係者に周知徹底させて実行し、維持し、継続的に改善します。
      <br />
      <br />
      11.お客様の権利
      一定の条件の下で、お客様は個人情報について適用法令が定める権利を有します。そのような法的権利の例として、以下が挙げられます。
      アクセス権－当社が保有するお客様の個人情報について問い合わせる、確認する、及びそのコピーの提供を求める権利。
      訂正権－当社が保有するお客様の個人情報が不正確である場合、その訂正を求める権利。お客様は、当社が保有するお客様の個人情報が不完全である場合、完全なものにするよう求める権利も有します。
      消去権－一定の条件の下で、お客様の個人情報の消去を求める権利。
      取り扱い制限権－一定の条件の下で、お客様の個人情報の取り扱いを制限するよう求める権利。
      異議申立権－一定の条件の下で、お客様の個人情報の取り扱いに対して異議を申し立てる権利。
      同意撤回権－お客様の個人情報の取り扱いの法的根拠が同意である場合に、同意を撤回する権利。同意を撤回した場合にも、同意を撤回する前に行われた取り扱いの効力には影響はありません。
      当社は、お客様の権利の行使に対し、適用法令が定める合理的な期間内に対応します。お客様がこれらの権利の行使を希望される場合、又はお客様の権利についてご質問がある場合、下記14記載のお問い合わせ先までご連絡ください。
      <br />
      <br />
      12.苦情
      お客様は、当社によるお客様の個人情報の取り扱いについて、個人情報保護監督当局に苦情を申し立てることができます。
      <br />
      <br />
      13.本ポリシーの変更
      当社は、本ポリシー（附属書を含みます。）を変更する場合には、当Webサイトへの掲載、お客様への電子メールの配信又はその他当社が適当であると判断する方法（適用法令により必要とされる方法がある場合にはそれに従います。）にて通知することにより、本ポリシーの全部又は一部を変更又は追加することができるものとします。この場合、お客様が当該通知を受領後初めて当Webサイトにアクセスした日と当該通知において定める日のいずれか早い時点から、変更後の本ポリシーが適用されるものとします。その他適用法令において必要な手続がある場合には、当該手続を講じます。
    </p>
  );
};

export default Document;
